Словарь/src/Catalogs/Словарь/Словарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Словарь</name>
  <attributes>
    <name>ЗаписьНаЯпонском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСлова</name>
    <type>
      <types>EnumRef.ВидыСлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйСлог</name>
    <type>
      <types>CatalogRef.Слоги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Слог</name>
      <type>
        <types>CatalogRef.Слоги</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>EnumRef.ВидыКаны</types>
      </type>
    </attributes>
    <attributes>
      <name>Канджи</name>
      <type>
        <types>CatalogRef.Канджи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставНовый</name>
    <attributes>
      <name>Моджи</name>
      <type>
        <types>CatalogRef.Моджи</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>EnumRef.ВидыКаны</types>
      </type>
    </attributes>
    <attributes>
      <name>Канджи</name>
      <type>
        <types>CatalogRef.Канджи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/InformationRegisters/НастройкиПодсказокКанджи/НастройкиПодсказокКанджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПодсказокКанджи</name>
  <resources>
    <name>КоличествоРядовПодсказок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСтолбцовПодсказок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Словарь/src/Catalogs/Словарь/Forms/ФормаНастроек/Module.bsl
#Область ОбработчикиСобытийФормы

// Вызывается после создания формы, но перед ее отображением.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущиеНастройки = РегистрыСведений.НастройкиПодсказокКанджи.ТекущиеНастройки();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТекущиеНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик команды "Сохранить".
//
&НаКлиенте
Процедура Сохранить(Команда)
	
	СтруктураНастроек = Новый Структура(
		"КоличествоРядовПодсказок, КоличествоСтолбцовПодсказок", КоличествоРядовПодсказок, КоличествоСтолбцовПодсказок);
	Если СохранитьНаСервере(СтруктураНастроек) Тогда
		Закрыть(СтруктураНастроек);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сохраняет настройки в регистре сведений.
//
&НаСервереБезКонтекста
Функция СохранитьНаСервере(СтруктураНастроек)
	
	Попытка
		РегистрыСведений.НастройкиПодсказокКанджи.ЗаписатьНастройки(СтруктураНастроек);
		Возврат Истина;
	Исключение
		КраткийТекстОшибки = НСтр("ru = 'Не удалось записать настройки подсказок канджи'") + Символы.ПС + ОписаниеОшибки();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = КраткийТекстОшибки;
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти
